/*

Cleaning Data in SQL Queries

*/

SELECT *
FROM 贵阳安居客数据.dbo.贵阳安居客

----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------

--Standardize Date Format规范日期格式
--替换REPLACE(列名，'替换前字符','替换后的字符')

SELECT 挂牌日期, REPLACE(REPLACE(REPLACE(挂牌日期, '年', '-'), '月', '-'),'日','') as 修改挂牌日期
FROM 贵阳安居客数据.dbo.贵阳安居客

ALTER TABLE 贵阳安居客数据.dbo.贵阳安居客
ADD 修改挂牌日期 NVARCHAR(10)

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 修改挂牌日期 = REPLACE(REPLACE(REPLACE(挂牌日期, '年', '-'), '月', '-'),'日','')

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 修改挂牌日期 = TRY_CONVERT(Date, 修改挂牌日期,120)

SELECT 挂牌日期, 修改挂牌日期
FROM 贵阳安居客数据.dbo.贵阳安居客

----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------

--Breaking out Address into Individual Columns(Address，District)将地址拆分成单独的列（地址、区）

ALTER TABLE 贵阳安居客数据.dbo.贵阳安居客
ADD 区 NVARCHAR(10)

ALTER TABLE 贵阳安居客数据.dbo.贵阳安居客
ADD 街道地址 NVARCHAR(80)

--ALTER TABLE 贵阳安居客数据.dbo.贵阳安居客
--DROP COLUMN 街道地址

--提取'观山湖区'
SELECT 地址, '观山湖'as 区
FROM 贵阳安居客数据.dbo.贵阳安居客
WHERE 地址 like '观山湖%'    --查看包含观山湖的地址

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 区 = '观山湖区'
WHERE 地址 like '观山湖%'

SELECT 地址,SUBSTRING(地址, 4 , LEN(地址)-3)
FROM 贵阳安居客数据.dbo.贵阳安居客
WHERE 地址 LIKE '%观山湖%'

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 街道地址 = SUBSTRING(地址, 4 , LEN(地址)-3)
WHERE 地址 like '观山湖%'

--提取'南明区'
SELECT 地址, '南明区'as 区
FROM 贵阳安居客数据.dbo.贵阳安居客
WHERE 地址 like '南明%' 

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 区 = '南明区'
WHERE 地址 like '南明%'

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 街道地址 = SUBSTRING(地址, 3 , LEN(地址)-2)
WHERE 地址 like '南明%'

--提取'云岩区'
SELECT 地址, '云岩区'as 区
FROM 贵阳安居客数据.dbo.贵阳安居客
WHERE 地址 like '云岩%' 

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 区 = '云岩区'
WHERE 地址 like '云岩%'

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 街道地址 = SUBSTRING(地址, 3 , LEN(地址)-3)
WHERE 地址 like '云岩%'

--提取'白云区'
SELECT 地址, '白云区'as 区
FROM 贵阳安居客数据.dbo.贵阳安居客
WHERE 地址 like '白云%' 

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 区 = '白云区'
WHERE 地址 like '白云%'

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 街道地址 = SUBSTRING(地址, 3 , LEN(地址)-3)
WHERE 地址 like '白云%'

--提取'乌当区'
SELECT 地址, '乌当区'as 区
FROM 贵阳安居客数据.dbo.贵阳安居客
WHERE 地址 like '乌当%' 

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 区 = '乌当区'
WHERE 地址 like '乌当%'

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 街道地址 = SUBSTRING(地址, 3 , LEN(地址)-3)
WHERE 地址 like '乌当%'

--提取'小河经开区'
SELECT 地址, '小河经开区'as 区
FROM 贵阳安居客数据.dbo.贵阳安居客
WHERE 地址 like '小河经开%' 

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 区 = '小河经开区'
WHERE 地址 like '小河经开%'

SELECT 地址, SUBSTRING(地址, 6 , LEN(地址)-5)
FROM 贵阳安居客数据.dbo.贵阳安居客
WHERE 地址 like '小河经开%'

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 街道地址 = SUBSTRING(地址, 6 , LEN(地址)-5)
WHERE 地址 like '小河经开%'

--提取'花溪区'
SELECT 地址, '花溪区'as 区
FROM 贵阳安居客数据.dbo.贵阳安居客
WHERE 地址 like '花溪%' 

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 区 = '花溪区'
WHERE 地址 like '花溪%'

UPDATE 贵阳安居客数据.dbo.贵阳安居客
SET 街道地址 = SUBSTRING(地址, 3 , LEN(地址)-3)
WHERE 地址 like '花溪%'


----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------

--删除带有清镇的房源的行

DELETE FROM 贵阳安居客数据.dbo.贵阳安居客
WHERE 地址 like '清镇%'

----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------

--Remove Duplicate (删重复的行）

WITH RowNumCTE AS   --创建公共表表达式（Common Table Expression, CTE）
(
SELECT *,
      ROW_NUMBER() OVER( 
	      PARTITION BY 小区, 面积, 单价, 总价,已满时间,所在楼层,总楼层,房间数  
		  --PARTITON BY是分区依据，根据 小区, 面积, 单价, 总价,已满时间,所在楼层,总楼层,房间数 分区，每一行记1，如果有两个上述相同的记2。
		  ORDER BY 小区) AS row_num
FROM 贵阳安居客数据.dbo.贵阳安居客       --此处没办法用WHERE row_num > 1 直接引用row_num,所以才利用CTE来创建临时表RowNumCTE，再引用row_num
)                                        --要和下面DELETE一起执行
DELETE 
FROM RowNumCTE
WHERE row_num > 1 

--查看是否删除成功
WITH RowNumCTE AS   --创建公共表表达式（Common Table Expression, CTE）
(
SELECT *,
      ROW_NUMBER() OVER( 
	      PARTITION BY 小区, 面积, 单价, 总价,已满时间,所在楼层,总楼层,房间数  
		  --PARTITON BY是分区依据，根据 小区, 面积, 单价, 总价,已满时间,所在楼层,总楼层,房间数 分区，每一行记1，如果有两个上述相同的记2。
		  ORDER BY 小区) AS row_num
FROM 贵阳安居客数据.dbo.贵阳安居客       --此处没办法用WHERE row_num > 1 直接引用row_num,所以才利用CTE来创建临时表RowNumCTE，再引用row_num
)                                        --要和下面SELECT一起执行
SELECT * 
FROM RowNumCTE
WHERE row_num > 1         --0行数据显示，可见上一部删除成功

----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------

--Change Y and N to '是' and '否' in "是否近地铁" field

SELECT 
是否近地铁,
CASE WHEN 是否近地铁 = '是' THEN 'Y'
     WHEN 是否近地铁 = '否' THEN 'N'
	 ELSE 是否近地铁 
	 END
FROM 贵阳安居客数据.dbo.贵阳安居客 

UPDATE 贵阳安居客数据.dbo.贵阳安居客 
SET 是否近地铁 = CASE WHEN 是否近地铁 = '是' THEN 'Y'
                    WHEN 是否近地铁 = '否' THEN 'N'
	                ELSE 是否近地铁 
	                END
FROM 贵阳安居客数据.dbo.贵阳安居客 

----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------

--Delete Unused Columns （删列）

ALTER TABLE 贵阳安居客数据.dbo.贵阳安居客 
DROP COLUMN 房间数, 描述, 挂牌日期, 地址

----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------

/*

Analysis Data in SQL Queries

*/

SELECT *
FROM 贵阳安居客数据.dbo.贵阳安居客

----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------

--Looking the number of listed properties in each district throughout the city. 查看全市各区所挂房源数
--Looking the proportion of listings in each district.查看各区房源数占比

SELECT 区, COUNT(区) AS 区挂房源排名,  COUNT(区) * 100.0 / (SELECT COUNT(*) FROM 贵阳安居客数据.dbo.贵阳安居客) AS 百分比
FROM 贵阳安居客数据.dbo.贵阳安居客
GROUP BY 区
ORDER BY 区挂房源排名 DESC

----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------

--Looking the average unit price in each district.查看各区的平均单价

SELECT 区, AVG(单价) AS 平均单价
FROM 贵阳安居客数据.dbo.贵阳安居客
GROUP BY 区
ORDER BY 平均单价 DESC

----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------

--Looking the city-wide average unit price.查看全市的平均单价

SELECT AVG(单价) AS 贵阳市平均单价
FROM 贵阳安居客数据.dbo.贵阳安居客

----------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------

--Looking the quantity of properties within different size ranges and their respective proportions.查看不同面积范围的房源数量以及占比

WITH 面积区域 AS (
    SELECT 
        CASE 
            WHEN 面积 > 150 THEN '150平方米以上'
            WHEN 面积 BETWEEN 120 AND 150 THEN '120-150平方米'
            WHEN 面积 BETWEEN 100 AND 120 THEN '100-120平方米'
			WHEN 面积 BETWEEN 80 AND 100 THEN '80-100平方米'
            ELSE '80平方米以下'
        END AS 面积区域,
        COUNT(*) AS 房源数量
    FROM 贵阳安居客数据.dbo.贵阳安居客
    GROUP BY 
        CASE 
            WHEN 面积 > 150 THEN '150平方米以上'
            WHEN 面积 BETWEEN 120 AND 150 THEN '120-150平方米'
            WHEN 面积 BETWEEN 100 AND 120 THEN '100-120平方米'
			WHEN 面积 BETWEEN 80 AND 100 THEN '80-100平方米'
            ELSE '80平方米以下'
        END
),
房源总数 AS (
    SELECT COUNT(*) AS 房源总数
    FROM 贵阳安居客数据.dbo.贵阳安居客
)

SELECT A.面积区域, A.房源数量, A.房源数量 * 100.0 / B.房源总数 AS 百分比
FROM 面积区域 AS A
CROSS JOIN 
    房源总数  AS B
ORDER BY 百分比 DESC

